solar_system/app/controllers/planets_controller.rb

    def show
        @planet = Planet.find params[:id]
---
SELECT "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        planet = Planet.create :name => params[:name], :image => params[:image], :orbit => params[:orbit], :diameter => params[:diameter], :mass => params[:mass], :moons => params[:moons]
---
INSERT INTO "planets" ("name", "image", "orbit", "diameter", "mass", "moons") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Jupiter"], ["image", ""], ["orbit", 4746.0], ["diameter", 456.0], ["mass", 45645.0], ["moons", 56]]

    def edit
        @planet = Planet.find params[:id]
---
SELECT "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def destroy
        planet = Planet.find params[:id]
        planet.destroy
---
SELECT "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 5]]